cfg_mnet = {
    'name': 'mobilenet0.25',
    'min_sizes': [[16, 32], [64, 128], [256, 512]],
    'steps': [8, 16, 32],
    'variance': [0.1, 0.2],
    'clip': False,
    'loc_weight': 2.0,
    'train_image_size': 840,
    'return_layers': {'stage1': 1, 'stage2': 2, 'stage3': 3},
    'in_channel': 32,
    'out_channel': 64
}

cfg_re50 = {
    'name': 'Resnet50',
    'min_sizes': [[16, 32], [64, 128], [256, 512]],
    'steps': [8, 16, 32],
    'variance': [0.1, 0.2],
    'clip': False,
    'loc_weight': 2.0,
    'train_image_size': 840,
    'return_layers': {'layer2': 1, 'layer3': 2, 'layer4': 3},
    'in_channel': 256,
    'out_channel': 256
}
model_args = {
        # ---------------------------------------------------------------------#
        #   使用自己训练好的模型进行预测一定要修改model_path
        #   model_path指向logs文件夹下的权值文件
        #   训练好后logs文件夹下存在多个权值文件，选择损失较低的即可。
        # ---------------------------------------------------------------------#
        "model_path": 'model_data/Retinaface_mobilenet0.25.pth',
        # ---------------------------------------------------------------------#
        #   所使用的的主干网络：mobilenet、resnet50
        # ---------------------------------------------------------------------#
        "backbone": 'mobilenet',
        # ---------------------------------------------------------------------#
        #   只有得分大于置信度的预测框会被保留下来
        # ---------------------------------------------------------------------#
        "confidence": 0.7,
        # ---------------------------------------------------------------------#
        #   非极大抑制所用到的nms_iou大小
        # ---------------------------------------------------------------------#
        "nms_iou": 0.45,
        # ---------------------------------------------------------------------#
        #   是否需要进行图像大小限制。
        #   开启后，会将输入图像的大小限制为input_shape。否则使用原图进行预测。
        #   可根据输入图像的大小自行调整input_shape，注意为32的倍数，如[640, 640, 3]
        # ---------------------------------------------------------------------#
        "input_shape": [1280, 1280, 3],
        # ---------------------------------------------------------------------#
        #   是否需要进行图像大小限制。
        # ---------------------------------------------------------------------#
        "letterbox_image": True
    }
mysql_cfg={
    "username":"face",
    "password":"wffp68j5cErWC6xA",
    "host":"127.0.0.1",
    "db":"face",
    "port":1236
}
jwt_cfg = {
    "key":"Pdjk0jD78"
}
cos_cfg = {
    "secret_id":"",
    "secret_key":"",
    "region":"",
    "bucket":""
}
